CNS/src/Catalogs/ПозицииШтатногоРасписания/ПозицииШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПозицииШтатногоРасписания</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководящаяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПозиции</name>
    <type>
      <types>EnumRef.СтатусыПозицииШтатногоРасписания</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникФинансирования</name>
    <type>
      <types>CatalogRef.ИсточникиФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисныйПроект</name>
    <type>
      <types>CatalogRef.СервисныеПроекты</types>
    </type>
  </attributes>
</mdclass:Catalog>

CNS/src/Enums/СтатусыПозицииШтатногоРасписания/СтатусыПозицииШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПозицииШтатногоРасписания</name>
  <enumValues>
    <name>Штат</name>
  </enumValues>
  <enumValues>
    <name>Вакансия</name>
  </enumValues>
</mdclass:Enum>

CNS/src/Catalogs/ПозицииШтатногоРасписания/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.СтатусПозиции = Перечисления.СтатусыПозицииШтатногоРасписания.ПустаяСсылка() Тогда
		
		ПараметрыПозиции = Новый Структура();
		ПараметрыПозиции.Вставить("ДатаАнализа", ТекущаяДатаСеанса());
		ПараметрыПозиции.Вставить("Позиция", 	 Объект.Ссылка);
		
		Если Бюджетирование.ПозицияШтатногоРасписанияЗанята(ПараметрыПозиции) Тогда 
			Объект.СтатусПозиции = Перечисления.СтатусыПозицииШтатногоРасписания.Штат;
		Иначе 
			Объект.СтатусПозиции = Перечисления.СтатусыПозицииШтатногоРасписания.Вакансия;
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;	
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
